/*
 * Default message keys for the jQuery validation plugin.
 */
jQuery.extend(jQuery.validator.messages, {
        required:"Это поле необходимо заполнить.",
        remote:"Пожалуйста, введите правильное значение.",
        email:"Пожалуйста, введите корректный адрес электронной почты.",
        url:"Пожалуйста, введите корректный URL.",
        date:"Пожалуйста, введите корректную дату.",
        dateISO:"Пожалуйста, введите корректную дату в формате ISO.",
        number:"Пожалуйста, введите число.",
        digits:"Поле может содержать только цифры",
        creditcard:"Пожалуйста, введите правильный номер кредитной карты.",
        equalTo:"Пожалуйста, введите такое же значение ещё раз.",
        accept:"Пожалуйста, выберите файл с правильным расширением.",
        maxlength:"Пожалуйста, введите не больше {0} символов.",
        minlength:"Пожалуйста, введите не меньше {0} символов.",
        rangelength:"Длина поля должны быть в пределах {0}-{1} знаков",
        range:"Пожалуйста, введите число от {0} до {1}",
        max:"Пожалуйста, введите число, меньшее или равное {0}",
        min:"Пожалуйста, введите число, большее или равное {0}"
});